performance_test/FIO/libaio/android/core1.log
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.26
Starting 1 process

rand_read: (groupid=0, jobs=1): err= 0: pid=23488: Mon Apr 21 16:59:21 2025
  read: IOPS=16.5k, BW=64.6MiB/s (67.7MB/s)(3229MiB/50001msec)
    slat (usec): min=10, max=11424, avg=50.35, stdev=65.88
    clat (usec): min=456, max=13204, avg=1880.35, stdev=450.16
     lat (usec): min=468, max=13275, avg=1931.48, stdev=454.50
    clat percentiles (usec):
     |  1.00th=[ 1106],  5.00th=[ 1369], 10.00th=[ 1467], 20.00th=[ 1598],
     | 30.00th=[ 1680], 40.00th=[ 1762], 50.00th=[ 1827], 60.00th=[ 1909],
     | 70.00th=[ 1991], 80.00th=[ 2114], 90.00th=[ 2311], 95.00th=[ 2507],
     | 99.00th=[ 3261], 99.50th=[ 3785], 99.90th=[ 6194], 99.95th=[ 7701],
     | 99.99th=[11338]
   bw (  KiB/s): min=59960, max=71440, per=100.00%, avg=66234.68, stdev=2023.31, samples=99
   iops        : min=14990, max=17860, avg=16558.61, stdev=505.81, samples=99
  lat (usec)   : 500=0.01%, 750=0.09%, 1000=0.50%
  lat (msec)   : 2=69.61%, 4=29.38%, 10=0.39%, 20=0.02%
  cpu          : usr=0.19%, sys=74.05%, ctx=58635, majf=0, minf=39
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=826695,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=64.6MiB/s (67.7MB/s), 64.6MiB/s-64.6MiB/s (67.7MB/s-67.7MB/s), io=3229MiB (3386MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=825190/224, merge=0/413, ticks=247512/303, in_queue=247826, util=79.81%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.26
Starting 1 process

rand_wr: (groupid=0, jobs=1): err= 0: pid=23724: Mon Apr 21 17:00:11 2025
  write: IOPS=10.0k, BW=39.1MiB/s (41.0MB/s)(1956MiB/50001msec); 0 zone resets
    slat (usec): min=14, max=5790, avg=86.54, stdev=86.35
    clat (usec): min=147, max=15851, avg=3102.24, stdev=672.03
     lat (usec): min=330, max=16105, avg=3189.86, stdev=682.22
    clat percentiles (usec):
     |  1.00th=[ 1172],  5.00th=[ 1942], 10.00th=[ 2311], 20.00th=[ 2671],
     | 30.00th=[ 2900], 40.00th=[ 3064], 50.00th=[ 3163], 60.00th=[ 3294],
     | 70.00th=[ 3425], 80.00th=[ 3556], 90.00th=[ 3752], 95.00th=[ 3949],
     | 99.00th=[ 4621], 99.50th=[ 5145], 99.90th=[ 7373], 99.95th=[ 8848],
     | 99.99th=[14222]
   bw (  KiB/s): min=37192, max=43744, per=100.00%, avg=40120.82, stdev=1204.33, samples=99
   iops        : min= 9298, max=10936, avg=10030.14, stdev=301.09, samples=99
  lat (usec)   : 250=0.01%, 500=0.03%, 750=0.15%, 1000=0.37%
  lat (msec)   : 2=4.96%, 4=90.49%, 10=3.96%, 20=0.03%
  cpu          : usr=0.16%, sys=59.73%, ctx=203500, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,500805,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=39.1MiB/s (41.0MB/s), 39.1MiB/s-39.1MiB/s (41.0MB/s-41.0MB/s), io=1956MiB (2051MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=0/500170, merge=0/483, ticks=0/120292, in_queue=120315, util=80.59%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.26
Starting 1 process

rand_read: (groupid=0, jobs=1): err= 0: pid=24013: Mon Apr 21 17:01:01 2025
  read: IOPS=16.5k, BW=64.4MiB/s (67.5MB/s)(3218MiB/50001msec)
    slat (usec): min=11, max=9108, avg=50.40, stdev=63.60
    clat (usec): min=196, max=11917, avg=1886.89, stdev=444.28
     lat (usec): min=232, max=11959, avg=1938.08, stdev=448.40
    clat percentiles (usec):
     |  1.00th=[ 1106],  5.00th=[ 1385], 10.00th=[ 1483], 20.00th=[ 1598],
     | 30.00th=[ 1696], 40.00th=[ 1762], 50.00th=[ 1844], 60.00th=[ 1909],
     | 70.00th=[ 2008], 80.00th=[ 2114], 90.00th=[ 2311], 95.00th=[ 2507],
     | 99.00th=[ 3326], 99.50th=[ 3916], 99.90th=[ 6194], 99.95th=[ 7111],
     | 99.99th=[10683]
   bw (  KiB/s): min=62251, max=71976, per=100.00%, avg=65984.51, stdev=2001.32, samples=99
   iops        : min=15562, max=17994, avg=16496.03, stdev=500.35, samples=99
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.08%, 1000=0.49%
  lat (msec)   : 2=69.13%, 4=29.83%, 10=0.45%, 20=0.02%
  cpu          : usr=0.13%, sys=74.23%, ctx=58996, majf=0, minf=38
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=823864,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=64.4MiB/s (67.5MB/s), 64.4MiB/s-64.4MiB/s (67.5MB/s-67.5MB/s), io=3218MiB (3375MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=822573/198, merge=0/321, ticks=237659/120, in_queue=237808, util=79.38%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.26
Starting 1 process

rand_wr: (groupid=0, jobs=1): err= 0: pid=24286: Mon Apr 21 17:01:52 2025
  write: IOPS=10.0k, BW=39.1MiB/s (41.0MB/s)(1954MiB/50001msec); 0 zone resets
    slat (usec): min=15, max=11080, avg=86.68, stdev=87.30
    clat (usec): min=8, max=17222, avg=3106.57, stdev=665.71
     lat (usec): min=288, max=17254, avg=3194.33, stdev=676.14
    clat percentiles (usec):
     |  1.00th=[ 1205],  5.00th=[ 1958], 10.00th=[ 2311], 20.00th=[ 2671],
     | 30.00th=[ 2900], 40.00th=[ 3064], 50.00th=[ 3195], 60.00th=[ 3294],
     | 70.00th=[ 3425], 80.00th=[ 3556], 90.00th=[ 3752], 95.00th=[ 3949],
     | 99.00th=[ 4555], 99.50th=[ 5145], 99.90th=[ 7504], 99.95th=[ 8717],
     | 99.99th=[13173]
   bw (  KiB/s): min=38080, max=44584, per=100.00%, avg=40064.94, stdev=1408.78, samples=99
   iops        : min= 9520, max=11146, avg=10016.15, stdev=352.23, samples=99
  lat (usec)   : 10=0.01%, 500=0.02%, 750=0.14%, 1000=0.34%
  lat (msec)   : 2=4.91%, 4=90.63%, 10=3.93%, 20=0.03%
  cpu          : usr=0.10%, sys=59.62%, ctx=203292, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,500123,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=39.1MiB/s (41.0MB/s), 39.1MiB/s-39.1MiB/s (41.0MB/s-41.0MB/s), io=1954MiB (2049MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=0/499435, merge=0/420, ticks=0/121600, in_queue=121633, util=80.47%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.26
Starting 1 process

rand_read: (groupid=0, jobs=1): err= 0: pid=24533: Mon Apr 21 17:02:42 2025
  read: IOPS=16.5k, BW=64.3MiB/s (67.4MB/s)(3215MiB/50001msec)
    slat (usec): min=11, max=8110, avg=50.51, stdev=60.68
    clat (usec): min=388, max=12090, avg=1888.64, stdev=424.81
     lat (usec): min=446, max=12103, avg=1939.94, stdev=428.27
    clat percentiles (usec):
     |  1.00th=[ 1139],  5.00th=[ 1385], 10.00th=[ 1500], 20.00th=[ 1614],
     | 30.00th=[ 1696], 40.00th=[ 1762], 50.00th=[ 1844], 60.00th=[ 1926],
     | 70.00th=[ 2008], 80.00th=[ 2114], 90.00th=[ 2311], 95.00th=[ 2474],
     | 99.00th=[ 3228], 99.50th=[ 3785], 99.90th=[ 5866], 99.95th=[ 7111],
     | 99.99th=[ 9503]
   bw (  KiB/s): min=61376, max=73456, per=100.00%, avg=65932.66, stdev=1927.10, samples=99
   iops        : min=15344, max=18364, avg=16483.10, stdev=481.76, samples=99
  lat (usec)   : 500=0.01%, 750=0.07%, 1000=0.44%
  lat (msec)   : 2=68.88%, 4=30.19%, 10=0.42%, 20=0.01%
  cpu          : usr=0.17%, sys=74.38%, ctx=58759, majf=0, minf=38
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=823064,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=64.3MiB/s (67.4MB/s), 64.3MiB/s-64.3MiB/s (67.4MB/s-67.4MB/s), io=3215MiB (3371MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=821617/182, merge=0/322, ticks=246498/90, in_queue=246609, util=79.52%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.26
Starting 1 process

rand_wr: (groupid=0, jobs=1): err= 0: pid=24787: Mon Apr 21 17:03:33 2025
  write: IOPS=9965, BW=38.9MiB/s (40.8MB/s)(1946MiB/50001msec); 0 zone resets
    slat (usec): min=15, max=10637, avg=86.84, stdev=87.00
    clat (usec): min=10, max=14371, avg=3118.00, stdev=648.98
     lat (usec): min=156, max=14429, avg=3206.00, stdev=659.40
    clat percentiles (usec):
     |  1.00th=[ 1254],  5.00th=[ 2008], 10.00th=[ 2343], 20.00th=[ 2704],
     | 30.00th=[ 2900], 40.00th=[ 3064], 50.00th=[ 3195], 60.00th=[ 3294],
     | 70.00th=[ 3425], 80.00th=[ 3556], 90.00th=[ 3752], 95.00th=[ 3916],
     | 99.00th=[ 4621], 99.50th=[ 5145], 99.90th=[ 7046], 99.95th=[ 8455],
     | 99.99th=[12780]
   bw (  KiB/s): min=37816, max=45096, per=100.00%, avg=39920.98, stdev=1267.18, samples=99
   iops        : min= 9454, max=11274, avg=9980.18, stdev=316.77, samples=99
  lat (usec)   : 20=0.01%, 250=0.01%, 500=0.02%, 750=0.11%, 1000=0.31%
  lat (msec)   : 2=4.54%, 4=91.09%, 10=3.90%, 20=0.03%
  cpu          : usr=0.14%, sys=59.80%, ctx=203583, majf=0, minf=8
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,498285,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=38.9MiB/s (40.8MB/s), 38.9MiB/s-38.9MiB/s (40.8MB/s-40.8MB/s), io=1946MiB (2041MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=0/497670, merge=0/339, ticks=0/118363, in_queue=118383, util=81.18%